{
  "basics": {
    "label": "Software Engineer",
    "email": "cjwilburn@gmail.com",
    "phone": "(215) 285-7595",
    "website": "https://cjwilburn.com",
    "name": "Courtney Wilburn",
    "summary": "I have a passion for building web applications and infrastructure.",
    "picture": "http://portfolio.cjwilburn.com/images/selfie.jpg",
    "profiles": [
      {
        "network": "Twitter",
        "username": "cjwilburn",
        "url": "https://twitter.com/cjwilburn"
      },
      {
        "network": "Github",
        "username": "cjwilburn",
        "url": "https://github.com/cjwilburn"
      },
      {
        "network": "Facebook",
        "username": "courtney.wilburn",
        "url": "https://www.facebook.com/courtney.wilburn"
      },
      {
        "network": "LinkedIn",
        "username": "cjwilburn",
        "url": "https://linkedin.com/in/cjwilburn"
      }
    ]
  },
  "work": [
    {
      "company": "The Wirecutter, A New York Times Company",
      "website": "https://thewirecutter.com",
      "position": "Lead DevOps Engineer",
      "startDate": "2017-10-30",
      "endDate": "",
      "summary": "Holds regular cross-team and Delivery team 1:1s. Provide technical guidance on product and platform architecture. Improved local development and deployment workflows for product-based engineering teams. Led transition of core Wirecutter application from monolithic to microservice architecture. Created custom server-side feature flagging process. Standing up microservices on AWS and GCP platforms. Assist in transitioning product engineering teams from waterfall workflow to continuous delivery.",
      "highlights": [
        "Attended Data for Black Lives 2019 Conference",
        "Featured on Github Blog in February 2019",
        "Featured on Revison Path Podcast",
        "On Inaugual List of Most Influental Technologists in Philadelphia"
      ]
    },
    {
      "company": "O3 World",
      "website": "https://o3world.com",
      "position": "Developer",
      "startDate": "2015-02-17",
      "endDate": "2017-10-27",
      "summary": "Developed services, sites, and web applications for a variety of clients. Spearheaded move from Vagrant to Docker for local development. Built and maintained systems infrastructures internally and externally. Built, deployed, and maintained enterprise applications and services in the AWS ecosystem. Moved projects from ad hoc deployment to Jenkins/CI/CD. Formalized DevOps best practices. Migrated web applications, microservices and APIs from PaaS to AWS and other platforms.",
      "highlights": [
        "Attended LGBTQ Tech & Innovation Summit at Google DC Spring 2017",
        "Attended White House LGBTQ Tech and Innovation Summit 2015 & 2016",
        "Spoke at NationJS 2015",
        "Spoke At Philly Tech Week Dev Day",
        "Panelist with Mayor of Philadelphia on Civic Tech for Philly Tech Week 2017",
        "Panelist for Tech In Color Philly Tech Week event",
        "Spoke at WordCamp US 2016",
        "Spoke at Creative Mornings Philadelphia March 2017"
      ]
    },
    {
      "company": "Self-Employed",
      "website": "http://cjwilburn.com",
      "position": "Freelance Web Developer",
      "startDate": "2009-08-01",
      "endDate": "",
      "summary": "Develop websites, applications, and custom CMS (Content Management Systems) for non-profit and community clients.",
      "highlights": [
        "Developed custom RFPMS (request for proposal management system) for evaluating and scoring RFPs.",
        "Created responsive websites."
      ]
    },
    {
      "company": "Wharton School of Business, University of Pennsylvania",
      "website": "http://wharton.upenn.edu",
      "position": "Web Application Developer, Wharton Computing",
      "startDate": "2011-03-15",
      "endDate": "2015-04-15",
      "summary": "Worked with team on developing a replacement for the Wharton Course Registration application in ColdFusion 10 and jQuery. Built custom ColdFusion 9 front-end and middle ware for LISTSERV product. Support existing Wharton Computing custom applications. Provide on-call application support as needed."
    },
    {
      "company": "School of Medicine, University of Pennsylvania, Department of Dermatology",
      "website": "https://www.med.upenn.edu",
      "position": "Systems Analyst, Dermatology Information Systems",
      "startDate": "2007-07-27",
      "endDate": "2011-03-12",
      "summary": "Build custom clinical, research, and administrative applications. Maintain Department Websites. Maintain and upgrade research, clinical, and administrative databases and applications. Perform hardware and software updates.  Provide backup hardware, software, and network support for Apple Macintosh and PC users in clinical and research settings. Provide software support for Electronic Medical Record application in Dermatology Outpatient Clinic."
    },
    {
      "company": "Internation Student Exchange Program (ISEP)",
      "website": "https://www.isepstudyabroad.org/",
      "position": "Communication and IS Administrator/Technology Officer/Senior Technology Officer",
      "startDate": "2005-12-05",
      "endDate": "2007-07-24",
      "summary": "  Performed hardware and software upgrades on networked office computers. Provided training and basic technical support to staff and member schools. Assessed and recommended hardware, software, and contracting expenditures. Prepared and tracked annual technology budget. Maintained MS Access frontend to T-SQL Server 2000 back-ended databases. Wrote and executed queries and reports for user needs. Administered IIS, Exchange, SQL Server 2000, Terminal Services, and network file servers. Managed nightly server tape backups. Maintained dynamic content for Internet website. Served as organizational and technical project manager in deployment of a new ISEP ASP.NET database information system. Served as liaison between ISEP and software support contractors.",
      "highlights": [
        "Began as IS Administrator, eventually promoted twice during my time there: first as 'Technology Officer', and again as 'Senior Technology Officer'."
      ]
    },
    {
      "company": "Total Document Solutions",
      "website": "http://www.totaldocuments.com/",
      "position": "File Clerk",
      "startDate": "2005-10-01",
      "endDate": "2005-12-01",
      "summary": "Supported and maintained a large SQL Server 2000 database for TDS client, Zuckerman Spaeder, LLP. Provided in-house training and assistance to legal secretaries while transitioning to new barcode-based universal legal filing system."
    },
    {
      "company": "Johns Hopkins School of Medicine",
      "website": "http://www.hopkinsmedicine.org/som/",
      "position": "Research Data Assistant III",
      "startDate": "2004-09-01",
      "endDate": "2005-09-01",
      "summary": "Assisted with research projects and developed study protocols in the department of Hospital Epidemiology and Infection Control. Created MS Access front end/SQL Server 2000 backend databases for data collection and analysis on research studies. Conducted trainings on nosocomial infections and infection control for clinical staff at Johns Hopkins Hospital. Collected environmental samples from patients for analysis. Obtained Institutional Review Board approval for research projects."
    },
    {
      "company": "SPARK Partnership for Service",
      "website": "http://www.sparkpfs.org/",
      "position": "Office Manager",
      "startDate": "2004-06-01",
      "endDate": "2004-09-01",
      "summary": "Organized meetings and day-to-day office activities. Maintained network server and provided technical support to staff. Ordered and inventoried all office supplies and training materials."
    },
    {
      "company": "Mazzoni Center",
      "website": "http://mazzonicenter.org",
      "position": "HIV Prevention Counselor",
      "startDate": "2002-08-01",
      "endDate": "2004-05-30",
      "summary": "Coordinated the implementation of an in-agency rapid HIV testing initiative. Assisted Mazzoni Center in obtaining State of Pennsylvania Level 2 laboratory certification for the administering of exams for blood-borne diseases.  Worked with clinical staff on development of rapid HIV testing procedures and trained clinic staff on protocols.  Sat on a municipal working group to implement rapid testing across Philadelphia. Provided individual HIV counseling and testing services to a diverse clientele at an HIV clinic and at off-site locations.  Maintained MS Access client referral database."
    },
    {
      "company": "Bryn Mawr College",
      "website": "https://brynmawr.edu",
      "position": "Hall Advisor",
      "startDate": "2000-08-15",
      "endDate": "2002-05-15",
      "summary": "Organized hall activities and served as a resource to dorm residents."
    },
    {
      "company": "Bryn Mawr College",
      "website": "https://brynmawr.edu",
      "position": "Teaching Assistant",
      "startDate": "2002-01-15",
      "endDate": "2002-05-15",
      "summary": "Proctored examinations and assisted students in physical anthropology lab sessions. Assisted professor in grading of mid-term and semester examinations. Was responsible for human skeletal remains and replicas for laboratory use."
    },
    {
      "company": "University of Pennsylvania Museum of Archaeology and Anthropology",
      "website": "",
      "position": "Intern",
      "startDate": "2001-05-15",
      "endDate": "2001-08-30",
      "summary": "Reorganized skeletal collections in physical anthropology section. Made ancient and modern skeletal replicas for educational use at the University of Pennsylvania casting program. Created digital catalog of modern human skeletal remains for the Museum. Completed digital documentation of the Samuel Morton skeletal collection at the University of Pennsylvania."
    },
    {
      "company": "Lavender Youth Recreation and Information Center",
      "website": "",
      "position": "Intern",
      "startDate": "2000-06-20",
      "endDate": "2000-08-30",
      "summary": "Assisted in organization of youth LBGT conference, donor library, and in the development of a youth outreach program through art.  Assisted in development of website for conferences, programs, and organization initiatives using DreamWeaver and Fireworks software packages. Led beginning PC skills classes for youth in afternoon drop-in center."
    }
  ],
  "education": [
    {
      "institution": "Bryn Mawr College",
      "courses": [
        "Senior thesis entitled “A Comparison of Traditional and Computer-Based Cranial Measurement Techniques: What Role Can Computers Play in Skeletal Remain Repatriation?” This thesis explored two main topics:  Whether it was possible to use emerging digital technologies to take accurate anthropometric measurements and what legal issues could possibly arise from the use of computer images of repatriated Native American skeletal remains in future physical anthropology research."
      ],
      "startDate": "1998-09-02",
      "endDate": "2002-05-15",
      "area": "Biological & Physical Anthropology",
      "studyType": "Bachelor of Arts"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "PHP",
        "Ruby",
        "Python"
      ]
    },
    {
      "name": "Public Speaking",
      "level": "Master",
      "keywords": [
        "Agile",
        "Web Development",
        "Project Management",
        "Back End Development"
      ]
    }
  ],
  "interests": [
    {
      "name": "Baseball",
      "keywords": []
    },
    {
      "name": "Basketball",
      "keywords": []
    },
    {
      "name": "Cooking",
      "keywords": []
    },
    {
      "name": "Traveling",
      "keywords": []
    },
    {
      "name": "Xymurgy",
      "keywords": []
    }
  ],
  "references": [
    {
      "name": "Provided Upon Request",
      "reference": "References provided upon request."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "HTML",
      "fluency": "Proficient"
    },
    {
      "language": "JavaScript",
      "fluency": "Proficient"
    },
    {
      "language": "CSS",
      "fluency": "Proficient"
    },
    {
      "language": "PHP",
      "fluency": "Proficient"
    },
    {
      "language": "SQL",
      "fluency": "Proficent in mySQL, T-SQL, PostgreSQL, and Oracle"
    },
    {
      "language": "Perl",
      "fluency": "Some"
    },
    {
      "language": "Python",
      "fluency": "Proificent"
    },
    {
      "language": ".NET",
      "fluency": "Proficient in VB and C#"
    },
    {
      "language": "noSQL",
      "fluency": "Proificent in MongoDB"
    },
    {
      "language": "ColdFusion",
      "fluency": "Proficient"
    }
  ]
}